thesis.tex
% Created 2022-05-12 Thu 01:54
% Intended LaTeX compiler: pdflatex
\documentclass[digital,oneside,oldtable,nolof,nolot,nocover]{fithesis4}
                           

\usepackage{style}
\setcounter{secnumdepth}{2}
\author{Ondřej Kuhejda}
\date{\today}
\title{Source Code Quality Impact \\ on Pull Requests Acceptance}
\begin{document}

\chapter{Introduction}
\label{sec:org9370293}
\emph{Does code quality influence the acceptance of pull requests?} Although many
project maintainers view code quality as the most important factor regarding
pull request acceptance~\cite{integrator}, a recent study by Lenarduzzi et al.
shows that the presence of quality flaws in the code does not influence the
acceptance or rejection of pull requests~\cite{quality}.

To the best of my knowledge, study by Lenarduzzi et al. is the only one that
investigated if quality issues affect the acceptance of pull requests. They
analyzed 28 well-known Java projects and applied several statistical
techniques to find the relation between code quality and pull request
acceptance. The quality of the pull requests was evaluated using the
open-source tool called PMD. This tool is able to perform static analysis of
the code and detect common programming flaws, such as code-smells,
anti-patterns, or code-style violations. Traditional statistical techniques
did not find any connection between the code quality and pull request
acceptance. Because of that, they trained several machine learning models to
predict the acceptance based on the quality issues found in the code. However,
machine learning models yielded similar results as traditional techniques.

Unfortunately, the study performed by Lenarduzzi et al., while an extensive
study, analyzed only projects written in Java. Moreover, 22 out of 28 analyzed
projects were from the Apache Software Foundation. This is the major threat to
the generalizability of their findings. To address these shortcomings, I
analyzed one hundred projects from five different programming languages ---
Python, Java, Kotlin, Haskell, and C/C++ (twenty projects per language). For
each programming language, a different tool for static analysis was used to
evaluate the code quality. I applied similar techniques as Lenarduzzi et
al. to analyze the relationship between the code quality and pull request
acceptance. Furthermore, the regression models were created to predict the
time required to close a pull request using the code quality. Subsequently,
the retrieved results were compared between individual languages.
The research questions set for this thesis are the following:
\begin{description}
\item[{RQ\textsubscript{1}}] Which code issues are typically introduced by the pull requests?
\item[{RQ\textsubscript{2}}] Are there some particular quality flaws that affect the acceptance of the pull request?
\item[{RQ\textsubscript{3}}] Is there a relationship between the source code quality and the pull request acceptance?
\item[{RQ\textsubscript{4}}] Does code quality influence the time required to close a pull request?
\item[{RQ\textsubscript{5}}] Is code quality impact higher in projects that are using some particular programming language?
\end{description}

This thesis first discusses code quality and its link to the pull-based
development model (Chapter~\ref{sec:org350eef2}).
After that, the various factors that influence the pull request acceptance are
mentioned (Chapter~\ref{sec:org34db84a}). The next part of the thesis
is dedicated to the research design. At first, I state how the data about the
project was retrieved and which methods were used to evaluate the code quality
of individual pull requests (Chapter~\ref{sec:orgb654080}). Then, the used
statistical methods are introduced (Chapter~\ref{sec:org82f3c27}). Furthermore,
the retrieved results are evaluated separately for each programming language
(Chapter~\ref{sec:org2c89279}). Towards the end, results are compared between
languages, and potential threats to validity are discussed. Finally, I
summarize my findings and compare them to the findings of Lenarduzzi et al.
(Chapter~\ref{sec:orge3d917e}). Moreover, the potential extensions of my work are
proposed.
\chapter{Code quality in pull-based development}
\label{sec:org350eef2}
The pull-based development model created novel ways how developers can
interact with each other. Instead of pushing code changes (patches) into
one central repository, developers can work in a more decentralized and
distributed way. This is mainly done by using distributed version control
systems such as Git. Git enables developers to clone repositories and thus
work independently on projects. Furthermore, Git's branching model helps
developers to keep track of repository changes and helps to handle the
conflicts between the different changes of the same code base~\cite{exploratory}.

To furthermore ease the complicated process of resolving conflicts between
different changes (of the same code base) and to provide a more user-friendly
environment for developers, platforms such as GitHub were created. These
platforms add new ways how the developers can interact beyond the basic
functionality of Git:
\begin{itemize}
\item The forks enable the creation of the server-side copy of the repository.
\item Pull requests\footnote{pull request is commonly abbreviated as PR}
(on some platforms called merge requests) enables to merge code directly on the platform.
\item Users can report issues found in the projects; therefore, the platform can also serve as a bug-tracking system.
\item The comments can be added to the pull requests and issues in order to build up social interaction between developers.
\item Users can star projects and follow other users, projects, pull requests, or issues.
\end{itemize}

In this study, I choose to use GitHub as the main source for data
mining. GitHub is one of the leading platforms that enables pull-based
collaboration between developers. GitHub hosts a huge amount of publicly
available repositories and GitHub also provides public REST API that can be
easily leveraged for data mining.

The aim of this thesis is to obtain a large amount of data about GitHub projects
and analyze the pull request in regard to their code quality. How the code
quality can be analyzed and how the GitHub platforms contribute to the quality of
the code itself is discussed in the following chapters.
