thesis.tex
\section{Measuring code quality}
\label{sec:org1534815}
Code quality is a very important aspect of every program --- software with high
code quality has a competitive advantage, is more stable, and is also more
maintainable than software that is poorly written.

To be able to evaluate the software in regard to its quality, there needs to
be some way how the code quality can measured. The testing can be used exactly
for this purpose --- as a tool for measuring the quality of the source code.
There are multiple ways how can be testing performed. Testing techniques can
be divided into two categories: static and dynamic testing techniques~\cite{istqb}.

In order to use dynamic testing techniques on a large number of programs, there
are two large obstacles --- the program needs to be executed, and there need
to be some inputs (with expected outputs) that can then be used for testing.
Program execution can be problematic. Some programs need to be compiled
before they can be executed; others require a special environment for their
execution (specific hardware, operating system, or shared libraries required
by the program). Moreover, most of the programs do not have predefined sets of
input that can be used for testing. There exist some techniques that can also be
used without the predefined inputs, such as fuzzing, but these techniques
are usually time-consuming. Because of that, dynamic testing techniques are
not a viable option when dealing with a large number of programs.

On the other hand, static testing methods suit the analysis of a large
number of programs better. Static techniques encompass the usage of formal and
informal reviews, walkthroughs, and inspections; however, these techniques are
performed by humans and therefore are not viable for large datasets. Because
of that, in this thesis, the quality of the given source code is evaluated
using the tools for automatic static analysis (called linters). Linters are
used to find defects and code smells in the source code without the need for
the source code's execution.

The ISO/IEC 25010~\cite{ISO25010} defines several quality characteristics which can be identified in the software.
I will now discuss these characteristics in the context of static analysis:
\begin{description}
\item[{Performance efficiency}] evaluates if the application is using the optimal amount of resources.
The static analysis can help to create a faster code.  For instance, some
linters are able to detect constructs/functions that are ineffective and
consume more resources than required.
\item[{Usability}] is the degree to which the software is easy to use. This quality is often evaluated through
\emph{usability testing}. On the other hand, there are some properties that can be checked via static analysis,
such as proper documentation of public interfaces, which contributes to the application's learnability.
\item[{Reliability}] defines how stable and fault-tolerant the software is.
Static analysis can unravel error-prone constructs and multi-threading issues
(that negatively influence stability) and ensure that exception handling is properly implemented.
\item[{Security}] is concerned with the confidentiality, integrity, and authenticity of the software.
Linters can detect several security-related issues in the source code, such as the use of vulnerable functions
or use of the hard-coded values for cryptographic operations.
\item[{Maintainability}] is the ease with which can be application modified.
Static analysis can help to ensure that source code is clean and
understandable.  Source code can be checked if it follows the conventions of
the given programming language. For instance, Python has an official style
guide for Python code --- PEP 8\footnote{\url{https://www.python.org/dev/peps/pep-0008/}}.
This guide defines the conventions that should be followed, such as proper
indentation of the code blocks, maximum line length, or naming conventions.
Furthermore, code can be analyzed if the software is properly designed and
does not use complicated constructs; for instance linter can detect if some
part of the code is redundant, complicated, or too coupled.
\item[{Portability}] is the ability to execute software on multiple platforms.
Some linters are capable of detecting functions and data types that are not portable.
\end{description}

However, it is important to note that not all linters have the same
capabilities. Issues that can be detected by the given linter heavily
depend on the used programming language (some quality issues are
language-specific). Which linters were used for the purposes of this thesis
is discussed later in the text.

The code issues (the number of their occurrences) identified by linters were
used as a metric to evaluate the code quality of the given pull request.  The
same approach was used by Lenarduzzi et al.~\cite{quality} during the evaluation
of the pull requests code quality.
\section{GitHub and code quality}
\label{sec:org70d0fa1}
GitHub brings many features that may potentially improve code quality.
GitHub has a built-in bug tracker which can be used to report issues found in the code.
Because the issues can be reported by users outside of the core development team,
the code quality issues can be detected earlier and more efficiently. Bug trackers
also enable prioritization of issues which helps to decide which problems need attention first.

Moreover, GitHub enables the creation of pull requests --- a mechanism by which the developers can propose changes to
the code base. When the pull request is submitted, the maintainers of the repository decide if the changes
will be applied (merged) or not (rejected). Quality can be one factor that can influence this decision.
The versatility of Git enables pull requests to be merged in various ways~\cite{exploratory}: through GitHub facilities,
using Git merge, or by committing the patch.

One of the pull requests advantages is the integration with the code review functionality. Maintainers of the projects
can review the code to improve internal code quality and maintainability.

GitHub provides CI/CD\footnote{continuous integration/continuous delivery}
functionality via GitHub Actions\footnote{\url{https://github.com/features/actions}}.
This enables to automatically run static analysis or automated tests whenever
some predefined event occurs, such as creating a new pull request.  Another
possibility is to add a linter directly to the build process and then trigger
the build using the GitHub Actions.  Trautsch et al.~\cite{pmd} analyzed several
open-source projects in regards to the usage of static analysis tools.  They
found out that incorporating a static analysis tool in a build process
reduces the defect density.
