thesis.tex
\chapter{Pull request acceptance}
\label{sec:org34db84a}
Pull request acceptance is a problem that has been studied multiple
times. Several surveys were performed in order to understand why pull requests
are being rejected.

Gousios et al.~\cite{integrator} surveyed hundreds of integrators to find out
their reasons behind the PR rejection. Code quality was stated as the main
reason by most of the integrators; code style was in the second place.
Factors that integrators examine the most when evaluating the code quality are
style conformance and test coverage.

Kononenko et al.~\cite{shopify} performed a study of an open-source project
called \emph{Shopify}; they manually analyzed PR's and also surveyed \emph{Shopify}
developers. They found out that developers associate the quality of PR with
the quality of its description and with the revertability and complexity of
the PR.

The reasons why contributors abandon their PRs were also
studied~\cite{abandonment}. Reason number one was the ``Lack of answers from
integrators.''; moreover, the ``Lack of time'' and the ``Pull request is
obsolete'' was also often stated as the main reason.

Even though the different open-source communities can approach the pull request acceptance in
a different manner, three main governance styles can be
identified --- protective, equitable, and lenient. The protective governance style
values trust in the contributor-maintainer relationship. The equitable
governance style tries to be unbiased towards the contributors, and the
lenient style prioritizes the growth and openness of the community~\cite{foss}.
Each style focuses on different aspects of PR. Tsay et al.~\cite{social}
identified the following levels of social and technical factors that influence
the acceptance of the PR --- \emph{repository level}, \emph{submitter level}, and the
\emph{pull request level}.
\section{Repository level}
\label{sec:orgac454c1}
The \emph{repository level} is interested in the aspects of the repository itself,
such as the repository age, number of collaborators, or number of stars on
the GitHub.

For instance, the programming language used in the project also influences
the acceptance of the PRs. Pull requests containing Java, JavaScript, or C++
code have a smaller chance of being accepted than PRs containing the code
written in Go or Scala~\cite{factors}.

Furthermore, older projects and projects with a large team have a
significantly lower acceptance rate~\cite{social}.

The popularity of the project also influences the acceptance rate ---
projects with more stars have more rejected PRs~\cite{social}.
\section{Submitter level}
\label{sec:org69a3262}
The \emph{submitter level} is concerned about the submitter's status in the
general community and his status in the project itself. There are several
parameters that can be considered when evaluating the submitter's status.

PRs of submitters with higher social connection to the project have a higher
probability of being accepted~\cite{social}.

Submitter status in the general community plays an important role in PR
acceptance. If the submitter is also a project collaborator, the likelihood
that the PR will be accepted increases by 63.3\%~\cite{social}.

Moreover, users that contributed to a larger number of projects have a higher
chance that their PR will be accepted~\cite{npm2}. The acceptance of the new
pull request also correlates with the acceptance of other older pull requests
created by the same submitter~\cite{npm}~\cite{replication}. Furthermore,
the first pull requests of users are more likely to be rejected~\cite{developers}.

The gender of the submitter is another factor that plays a role in PR
acceptance. A study showed that woman's PR are accepted more often, but only
when they are not identifiable as a woman~\cite{gender}.

Personality traits also influence PR acceptance. The \emph{IBM Watson Personality
Insights} were used to obtain the personality traits of the PR submitters by
analyzing the user's comments. These traits were then used to study PR
acceptance. It has been shown that conscientiousness, neuroticism, and
extroversion are traits that have positive effects on PR acceptance. The
chance that PR will be accepted is also higher when the submitter and closer
have different personalities~\cite{personality}.
\section{Pull request level}
\label{sec:org57a3a02}
The \emph{pull request level} is interested in the data about
PR itself.  For instance, on the \emph{PR level}, one can study if there is
a correlation between PR acceptance and the number of GitHub comments in
the PR.

One of the factors that negatively influence the acceptance rate is the
number of commits in the pull request. The high number of
commits decreases the probability of acceptance. On the other hand, PRs with
only one commit are exceptions --- they have a smaller chance of being accepted
than pull requests which contain two commits~\cite{npm2}.

Another observation is that more discussed PRs have a smaller chance of being
accepted~\cite{social}.  Another study did not find a large difference between
accepted and rejected PRs based on the number of comments but found that
discussions in rejected PRs have a longer duration~\cite{discussion}.
Moreover, the increasing number of changed lines decreases the
likelihood of PR acceptance~\cite{social}.

The code quality is an essential factor on the \emph{pull request level}, and it
is this study's main interest.  The code quality as the acceptance factor is
examined in the following subchapter.
\subsection*{Code quality}
\label{sec:org06b1ef1}
One of the instruments that ensure that the code has high quality is testing.
Proper testing is a crucial part of every project. Testing plays a
significant role in discovering bugs and therefore leads to higher code
quality.  One study found that PRs, including more tests, have a higher
chance of being accepted~\cite{social}. However, another study yields no
relation between acceptance and test inclusion~\cite{exploratory}.

Another factor that is closely tied to code quality is the code style.
Proper and consistent code style increases the maintainability of the
software.  The code style inconsistency has a small (but not negligible)
negative effect on acceptance. PRs with larger code style inconsistency
(with the codebase) have a smaller chance of being accepted.  Code style
inconsistency also negatively influences the time required to close a
PR~\cite{style}.

Although many integrators view code quality as the most important factor
regarding PR acceptance~\cite{integrator}, to the best of my knowledge, only
one study~\cite{quality} was performed to discover whether there is a
connection between the PR's acceptance and the quality flaws found in the
code (taking into account more complicated aspects than code style or test
inclusion).

Lenarduzzi et al.~\cite{quality} analyzed 28 open-source projects. The results show that
there is no significant connection between code quality and PR acceptance.
The key difference (from my thesis) is that they analyzed only projects written
in Java. Furthermore, my thesis investigates the connection between the time to close a
PR and the PR quality. Further comparison is at the end of the thesis.
