thesis.tex
\chapter{Data mining}
\label{sec:orgb654080}
\begin{figure}[htb]\centering
\begin{tikzpicture}
\node (n1) [align=center] {Project name};

\node (n2) [box, above=2cm of n1, align=center] {\texttt{gh\_db.py}\\(\texttt{gh\_rest.py})};
\node (n3) [cloud, draw, above=of n2, align=center, inner sep=-3mm] {GHTorrent database\\(GitHub REST API)};
\node (c1) [container, fit=(n2)(n3)] {};

\node (n4) [right=2cm of n2, align=center, margin] {Pull requests\\information};

\node (n5) [box, right=of n4] {\texttt{git-contrast}};
\node (n6) [cloud, draw, above=of n5] {Linters};
\node (c2) [container, fit=(n5)(n6)] {};

\node (c3) [container, thick, fit=(c1)(c2)] {};

\node (n7) [below=2.5cm of n5, align=center] {JSON};

\node [below left, inner sep=3mm] at (current bounding box.north east) {\texttt{pr\_quality.py}};

\draw[->] (n1) to (n2);
\draw[<->] (n2) to (n3);
\draw[->] (n2) to (n4);
\draw[->] (n4) to (n5);
\draw[<->] (n5) to (n6);
\draw[->] (n2) edge node[sloped, below, align=center, font=\fontsize{8pt}{8pt}\selectfont] {Project\\information} (n7);
\draw[->] (n5) edge node[right, yshift=-4mm, align=center, font=\fontsize{8pt}{8pt}\selectfont] {Pull requests\\code quality} (n7);
\end{tikzpicture}
\caption{The \texttt{pr\_quality.py} workflow}\label{fig:mining_workflow}
\end{figure}
Information about the pull requests is retrieved using the \texttt{pr\_quality.py}
script. This script takes the names of the projects that will be analyzed as the
input, and it outputs the JSON files containing information about the projects
and their code quality (Figure~\ref{fig:mining_workflow}). The script
needs to retrieve the metadata for each project and its pull requests. There
are two possible sources that can be used: GitHub REST API and the GHTorrent
database. Which source will be used can be specified by passing an argument to
the tool. Metadata are then used to determine which objects need to be
fetched from the GitHub to perform the code quality analysis. The analysis of
the pull request itself is performed by an external tool called \texttt{git-contrast}.

The \texttt{gh\_db.py} is a script responsible for querying the GHTorrent database in order to
obtain data about the projects. The GHTorrent database~\cite{ghtorrent} is an offline mirror of
data offered through the GitHub REST API. \texttt{gh\_db.py} returns a JSON file
with the information about the project, such as the number of stars, number of
contributors, or information about pull requests and their commits.

An alternative script that can be used by \texttt{pr\_qality.py} is \texttt{gh\_rest.py}.
This script uses the GitHub REST API directly. The advantage of this
script is that it can retrieve the newest data from GitHub. Unfortunately,
the REST API is limited by the number of requests per hour. Because of that,
the \texttt{gh\_rest.py} is programmed to retrieve only a subset of data that are
obtained by \texttt{gh\_db.py} (data not crucial for the analysis are
omitted).

However, GitHub lacks information about the code quality of
the pull requests. This is where the \texttt{git-contrast} comes into play.
\texttt{git-contrast} is the command-line application that analyzes the code quality
of the given pull request using the external linters. This application is
further discussed in the following sections.
\section{GitHub metadata}
\label{sec:orgf27b20d}
As stated before, the scripts \texttt{gh\_db.py} and \texttt{gh\_rest.py} are used
to retrieve data from GitHub. GitHub can be leveraged to obtain
many interesting metadata, which can possibly influence the acceptance of pull
requests. All the metadata that are obtained using the scripts are listed
in Table \ref{tab:orga71f9c2}.
\begin{table}[h]
\caption{\label{tab:orga71f9c2}Data retrieved from GitHub}
\centering
\begin{tabular}{|llcc|}
\hline
Level & Metadata & \texttt{gh\_db.py} & \texttt{gh\_rest.py}\\
\hline
\hline
Repository level & Project name & \ding{51} & \ding{51}\\
 & Programming language & \ding{51} & \ding{51}\\
 & Time of creation & \ding{51} & \ding{51}\\
 & Number of forks & \ding{51} & \ding{51}\\
 & Number of commits & \ding{51} & \ding{55}\\
 & Number of project members & \ding{51} & \ding{55}\\
 & Number of stars & \ding{51} & \ding{51}\\
\hline
Submitter level & Username & \ding{51} & \ding{51}\\
 & Number of followers & \ding{51} & \ding{55}\\
 & Status in the project & \ding{51} & \ding{51}\\
\hline
Pull request level & Pull request ID & \ding{51} & \ding{51}\\
 & Is PR accepted? & \ding{51} & \ding{51}\\
 & Time opened & \ding{51} & \ding{51}\\
 & Head repository & \ding{51} & \ding{51}\\
 & Head commit & \ding{51} & \ding{51}\\
 & Base commit & \ding{51} & \ding{51}\\
 & Number of commits & \ding{51} & \ding{55}\\
 & Number of comments & \ding{51} & \ding{55}\\
\hline
\end{tabular}
\end{table}

Metadata like ``Number of stars'' or ``Time opened'' are required for the
statistical analysis.  Others are not meant to be used as a part of the
analysis itself but are kept here for better orientation, and some of them
are needed for the \texttt{git-contrast} tool, such as ``Head commit'', ``Base commit'', etc.
