thesis.org
** Evaluating code quality
   =git-contrast= is the command-line application that I implemented in order to
   be able to analyze the code quality of the given pull request. The =git-contrast=
   expects two commit hashes on the input and returns the information about the
   change in code quality between these commits on the output.
   The number of found code quality issues is
   then written to the standard output.

   To measure the change in the quality of the pull request, the
   =git-contrast= is run on the "head commit" and the "base commit" of the given
   pull request. The =git-contrast= supports several linters; which linter will be
   used is determined by the file extension of the tested file (Table [[table:linters]]).
   #+CAPTION: Linters supported by =git-contrast=
   #+LABEL: table:linters
   #+ATTR_LaTeX: :align |lcll|
   |--------------+---------+----------------------+-----------------------|
   | Linter       | Version | Programming language | File extensions       |
   |--------------+---------+----------------------+-----------------------|
   |--------------+---------+----------------------+-----------------------|
   | [[https://pylint.pycqa.org/][*Pylint*]]     |  2.12.2 | Python               | =.py=                 |
   | [[https://pmd.github.io/][*PMD*]]        |  6.42.0 | Java                 | =.java=               |
   | [[https://ktlint.github.io/][*ktlint*]]     |  0.43.2 | Kotlin               | =.kt= and =.kts=      |
   | [[https://github.com/ndmitchell/hlint][*HLint*]]      |   3.2.8 | Haskell              | =.hs=                 |
   | [[https://dwheeler.com/flawfinder/][*flawfinder*]] |  2.0.19 | C/C++                | =.c=, =.cpp= and =.h= |
   |--------------+---------+----------------------+-----------------------|

   The most problematic was to statically analyze the C/C++ source files because
   some linters also need the information on how the source code should be
   compiled. I tested the OCLint and Cppcheck linters but without success.
   The compilation flags cannot always be automatically determined from the makefiles.
   Because of that, I settled on using the flawfinder, which performs a simpler analysis and
   does not require compilation flags.

   The following linters are supported by =git-contrast=:
   - Pylint :: Python linter that is able to detect programming errors and helps
     enforce coding standards[fn::https://peps.python.org/pep-0008/].
     Issues are divided into the following categories: conventions, code smells,
     warnings (Python-specific problems), and errors.
   - PMD :: Linter that is able to discover common programming flaws. It is mainly
     concerned with Java and Apex programming languages. PMD is extensible but also
     provides many predefined rulesets: "Best Practices", "Code style", "Security"\dots
     All Java rule sets available in the basic installation were used to evaluate code quality.
   - ktlint :: Simple static analyzer focused on the code clarity and community
     conventions[fn::https://kotlinlang.org/docs/coding-conventions.html].
     This linter uses only a small set of carefully selected rules.
   - HLint :: Tool for suggesting possible improvements to Haskell code.
     Every hint has one of the following severity levels: error, warning, and suggestion.
   - flawfinder :: A simple program that examines C/C++ code and searches for potentially
     dangerous functions. This is done using the built-in database of functions with
     well-known problems. Linter uses the following risk levels: note, warning, and error.
** Projects selection
   In total, 100 projects were selected written in five different
   programming languages (20 projects for each language).  The analyzed GitHub
   projects were selected based on the following criteria:
   - The primary programming language is Python, Java, Kotlin, Haskell, or C/C++.
   - The project is popular --- it is in the top 150 most favorite projects written in the given language.
     One of the reasons to analyze popular projects is the fact that popularity influences acceptance[[cite:social]].
     Popular projects also usually contain a high number of pull requests.
     Two different lists of popular projects were used: projects sorted by the
     number of stars using the GHTorrent database (data from \nth{1} June 2019) and the list from
     GitHub[fn::https://github.com/EvanLi/Github-Ranking] (data from \nth{1} January 2022).
   - The project contains at least 200 pull requests that are suitable for analysis.
     This means that PR needs to contain at least one file written in the
     primary language and the data about PR needs to be publicly available.
   - The project is using GitHub to merge pull requests (for most of the pull requests).
   - The project is a library, program, or collection of programs. Repositories whose primary purpose is
     to store configuration files, documentation, books, etc., were ignored.
** TODO Computational resources
* Data analysis
  In this chapter, I am explaining which statistical methods were chosen in
  order to answer the research questions.  Research questions 1 to 4 were
  analyzed separately for each programming language; therefore, also the
  techniques that will be discussed were applied separately.  Only the last
  research question discuss multiple languages at the same time and compares
  results retrieved from the individual analysis of each language.
*** Which code issues are typically introduced by the pull requests?
    At first, in order to answer the *RQ_1*, I summarized the retrieved data for each project
    --- I counted how many suitable pull requests were analyzed and
    how many of them were accepted/rejected. Then I created a scatter plot between the number of
    stars and the percentage of accepted PRs.

    I also summarized all pull requests regardless of their project. I computed the average number
    of introduced issues, fixed issues, etc. Then I created a heat map that shows how many PRs
    introduced/fixed some specific number of issues.

    Then for each issue individually, I computed how many accepted/rejected pull
    requests introduced/fixed this issue, how many times this issue occurred in
    some pull request, etc. I created multiple lists of issues sorted by various parameters.
    I sorted issues by the number of rejected/accepted PRs that fixed/introduced them.
    I also listed issues and the percentage of PRs that changed their quality. I examined the
    issues that were fixed in a larger number of PRs than introduced. Then I created a scatter plot
    that shows which issue category is the most common.

    These steps were applied individually for each programming language to determine
    how does the average PR look line in terms of code quality.
