thesis.tex
\section{Evaluating code quality}
\label{sec:orgd68ce38}
\texttt{git-contrast} is the command-line application that I implemented in order to
be able to analyze the code quality of the given pull request. The \texttt{git-contrast}
expects two commit hashes on the input and returns the information about the
change in code quality between these commits on the output.
The number of found code quality issues is
then written to the standard output.

To measure the change in the quality of the pull request, the
\texttt{git-contrast} is run on the ``head commit'' and the ``base commit'' of the given
pull request. The \texttt{git-contrast} supports several linters; which linter will be
used is determined by the file extension of the tested file (Table \ref{tab:org57934c1}).
\begin{table}[htbp]
\caption{\label{tab:org57934c1}Linters supported by \texttt{git-contrast}}
\centering
\begin{tabular}{|lcll|}
\hline
Linter & Version & Programming language & File extensions\\
\hline
\hline
\href{https://pylint.pycqa.org/}{\textbf{Pylint}} & 2.12.2 & Python & \texttt{.py}\\
\href{https://pmd.github.io/}{\textbf{PMD}} & 6.42.0 & Java & \texttt{.java}\\
\href{https://ktlint.github.io/}{\textbf{ktlint}} & 0.43.2 & Kotlin & \texttt{.kt} and \texttt{.kts}\\
\href{https://github.com/ndmitchell/hlint}{\textbf{HLint}} & 3.2.8 & Haskell & \texttt{.hs}\\
\href{https://dwheeler.com/flawfinder/}{\textbf{flawfinder}} & 2.0.19 & C/C++ & \texttt{.c}, \texttt{.cpp} and \texttt{.h}\\
\hline
\end{tabular}
\end{table}

The most problematic was to statically analyze the C/C++ source files because
some linters also need the information on how the source code should be
compiled. I tested the OCLint and Cppcheck linters but without success.
The compilation flags cannot always be automatically determined from the makefiles.
Because of that, I settled on using the flawfinder, which performs a simpler analysis and
does not require compilation flags.

The following linters are supported by \texttt{git-contrast}:
\begin{description}
\item[{Pylint}] Python linter that is able to detect programming errors and helps
enforce coding standards\footnote{\url{https://peps.python.org/pep-0008/}}.
Issues are divided into the following categories: conventions, code smells,
warnings (Python-specific problems), and errors.
\item[{PMD}] Linter that is able to discover common programming flaws. It is mainly
concerned with Java and Apex programming languages. PMD is extensible but also
provides many predefined rulesets: ``Best Practices'', ``Code style'', ``Security''\dots{}
All Java rule sets available in the basic installation were used to evaluate code quality.
\item[{ktlint}] Simple static analyzer focused on the code clarity and community
conventions\footnote{\url{https://kotlinlang.org/docs/coding-conventions.html}}.
This linter uses only a small set of carefully selected rules.
\item[{HLint}] Tool for suggesting possible improvements to Haskell code.
Every hint has one of the following severity levels: error, warning, and suggestion.
\item[{flawfinder}] A simple program that examines C/C++ code and searches for potentially
dangerous functions. This is done using the built-in database of functions with
well-known problems. Linter uses the following risk levels: note, warning, and error.
\end{description}
\section{Projects selection}
\label{sec:orgddcbc6e}
In total, 100 projects were selected written in five different
programming languages (20 projects for each language).  The analyzed GitHub
projects were selected based on the following criteria:
\begin{itemize}
\item The primary programming language is Python, Java, Kotlin, Haskell, or C/C++.
\item The project is popular --- it is in the top 150 most favorite projects written in the given language.
One of the reasons to analyze popular projects is the fact that popularity influences acceptance~\cite{social}.
Popular projects also usually contain a high number of pull requests.
Two different lists of popular projects were used: projects sorted by the
number of stars using the GHTorrent database (data from \nth{1} June 2019) and the list from
GitHub\footnote{\url{https://github.com/EvanLi/Github-Ranking}} (data from \nth{1} January 2022).
\item The project contains at least 200 pull requests that are suitable for analysis.
This means that PR needs to contain at least one file written in the
primary language and the data about PR needs to be publicly available.
\item The project is using GitHub to merge pull requests (for most of the pull requests).
\item The project is a library, program, or collection of programs. Repositories whose primary purpose is
to store configuration files, documentation, books, etc., were ignored.
\end{itemize}
\section{{\bfseries\sffamily TODO} Computational resources}
\label{sec:orgf656e2f}
\chapter{Data analysis}
\label{sec:org82f3c27}
In this chapter, I am explaining which statistical methods were chosen in
order to answer the research questions. RQ\textsubscript{1}--RQ\textsubscript{4} were
analyzed separately for each programming language; therefore, also the
techniques that will be discussed were applied separately.  Only the last
research question discuss multiple languages at the same time and compares
results retrieved from the individual analysis of each language.
\section{RQ\textsubscript{1}: Which code issues are typically introduced by the pull requests?}
\label{sec:org0044dcd}
At first, in order to answer the RQ\textsubscript{1}, I summarized the retrieved data for each project
--- I counted how many suitable pull requests were analyzed and
how many of them were accepted/rejected. Then I created a scatter plot between the number of
stars and the percentage of accepted PRs.

I also summarized all pull requests regardless of their project. I computed the average number
of introduced issues, fixed issues, etc. Then I created a heat map that shows how many PRs
introduced/fixed some specific number of issues.

Then for each issue individually, I computed how many accepted/rejected pull
requests introduced/fixed this issue, how many times this issue occurred in
some pull request, etc. I created multiple lists of issues sorted by various parameters.
I sorted issues by the number of rejected/accepted PRs that fixed/introduced them.
I also listed issues and the percentage of PRs that changed their quality. I examined the
issues that were fixed in a larger number of PRs than introduced. Then I created a scatter plot
that shows which issue category is the most common.

These steps were applied individually for each programming language to determine
how does the average PR look line in terms of code quality.
