thesis.org
*** Are there some particular quality flaws that affect the acceptance of the pull request?
    In order to discover issues that affect the acceptance of pull requests
    most, the classification models were created.  The aim of these models is to
    classify pull requests into two groups (accepted PRs and rejected PRs) by
    using the information about the quality change in the given pull
    request. Multiple classification algorithms were
    used[fn::https://scikit-learn.org/stable/modules/classes.html]:
    - LogisticRegression :: Despite its name, logistic regression is a linear model used for classification. It uses
      a so-called /logistic function/ that turns the inputs (code quality issues)
      into the probability of the dependent variable (PR acceptance) being 1 (PR is
      accepted).
    - DecisionTrees :: This algorithm constructs the tree where leaves represent the different classes (PR accepted/rejected),
      and inner nodes represent the so-called /split criterion/ --- the condition
      (or predicate) on single/multiple attributes (code quality issues).
      The /split criterion/ defines to which subtree given input (pull
      request) belongs.
    - Bagging :: The Bagging algorithm is trying to predict the data class (PR being rejected/accepted)
      using multiple different classifiers. It uses bootstrapping[fn::random sampling with replacement]
      to construct the different data sets for each
      classifier. The outputs from these classifiers are then aggregated to form
      the final prediction.
    - RandomForest :: This classifier leverages the bagging method in order to create the forest of
      uncorrelated decision trees (to avoid bias and overfitting). Unlike the decision trees,
      the RandomForest uses only a subset of features (code quality issues) to generate the decision tree
      (this ensures the low correlation between the trees).
    - ExtraTrees :: ExtraTrees is a classifier similar to RandomForest.
      The main difference is that the ExtraTrees algorithm generates /split
      criterions/ using randomization.  Another key difference is that
      ExtraTrees uses whole original sample for each tree (instead of
      bootstrapping).
    - AdaBoost :: The AdaBoost is another algorithm that leverages multiple weak classifiers (usually DecisionTrees with only one
      /split criterion/) to predict the final result. It begins by fitting a
      classifier on the original dataset. Each subsequent classifier is
      improved using the results from the previous one (incorrectly classified
      pull requests have a higher chance of being selected in the next
      classifier).
    - GradientBoost :: The GradientBoost algorithm is similar to the AdaBoost. It is also
      using multiple weak classifiers, and they are trained one by one. However,
      instead of improving the
      subsequent classifier by changing the training dataset distribution, the GradientBoost algorithm
      trains the classifiers using the residual errors of predecessors. Furthermore, the GradientBoost
      works with larger trees than AdaBoost.
    - XGBoost :: XGBoost is a popular variant of gradient boosting. It is designed to be fast
      and efficient.
    Each of those algorithms was run on three different datasets --- a dataset
    with quality change, a dataset containing only introduced issues, and a dataset
    with only fixed issues. In the first dataset, the quality change for some issues was
    represented by the integer, and this integer was negative if the issue was fixed in the PR
    and positive if the issue was introduced. The other datasets were created by filtering
    positive/negative values from the first dataset. Running the classification algorithms on
    the dataset with only fixed issues can help to understand if the improvement in code quality
    can also influence the acceptance.

    In order to recognize issues that have some effect on the PR acceptance,
    the /drop-column importance/ mechanism[fn::https://explained.ai/rf-importance/] was used.
    This mechanism is resource-intense (requires a lot of computational power) but is usually more reliable
    than the classic importance mechanisms.

    The dataset was split into five parts to better evaluate the model accuracy
    (5-fold cross-validation).  Each model was then trained five times ---
    a distinct dataset was used for training and for validation.  Several metrics
    (precision, recall, AUROC, F-measure\dots) were used to evaluate the
    reliability of each model. Afterward, the average metrics over all folds
    were computed.

    The same technique was used by Lenarduzzi et al.[[cite:quality]]. The script
    they provided (slightly modified) was used to run the classification
    algorithms.
*** Is there a relationship between the source code quality and the pull request acceptance?
    At first, the PCA (principal component analysis) scatter plot was created to
    visualize the difference between accepted and rejected pull requests.

    The impact of the presence of some code issue in the PR on the PR acceptance was
    determined using the $\chi^2$ test. In order to perform this test, the dataset
    was transformed into a /contingency table/.  This table ($2 \times 2$) contained
    the number of accepted/rejected PRs with/without a code quality issue.
    After that, the $\chi^2$ test of independence was performed on the
    /contingency table/.  The /significance level/ was set to $\alpha =
    0.05$. However, relying only on statistical significance can be misleading
    because it is affected by sample size. To understand the practical
    significance of the test (/effect size/), the Cramer's V denoted as $\phi_c$
    was also computed. The Cramer's V ranges between 0 (no
    association) and 1 (complete association).

    Pull request that adds or removes some files greatly influences
    code quality. If the number of removed/added files has a large impact on PR
    acceptance (regardless of code quality), then it can be a large threat to
    the validity of the independence test.  The pull request acceptance can also be
    influenced by the quality of files which were not linted (were written in
    non-primary language).  To eliminate the risk that the test was influenced,
    the same test was performed on pull requests that only modified some source
    files, and these files were written in the primary language.

    Moreover, the $\chi^2$ test was performed independently for each issue
    category to understand if there are some issue categories that have a
    stronger influence on the quality.

    The test was also computed for each project separately. Unluckily, there are
    some projects that contain an insufficient number of pull requests.  According
    to Cochran[[cite:cochran]], all expected counts should be ten or greater.
    Therefore, the tests were performed only on some projects (that have a sufficient
    number of expected counts).

    It is important to note that p-values were not adjusted in any way.

    The metrics obtained from classification algorithms were also used to
    determine if the code quality has some impact on PR acceptance.
