thesis.org
*** Does code quality influence the time required to close a pull request?
    In order to find the possible link between the code quality and the time it
    takes to close a PR, regression algorithms were used. At first, the
    dataset was split into two parts --- training and test set.  After that, the
    regression model was trained on the training set. Then, the importance of
    individual quality issues was determined using the /permutation importance/
    mechanism. Afterward, the model was used to predict the
    time based on the data from the test set. Metrics such as /mean absolute error/
    (MAE), /mean squared error/ (MSE), and /coefficient of determination/ ($R^2$)
    were computed using the predicted and expected values and used to evaluate the
    models.

    Following regressors were used[fn::https://scikit-learn.org/stable/modules/linear_model.html]:
    - LinearRegression :: Linear regression is a commonly used type of predictive model.
      It is used for modeling the linear relationship between explanatory variables (code quality issues)
      and a scalar response (time to close a PR). The model that minimizes the residual sum of squares
      is selected.
    - ElasticNet :: ElasticNet is an extension of linear regression. It is adding $L_1$ (lasso regression)
      and $L_2$ (ridge regression) penalties in order to make the linear model more robust.
      The problem with the classic linear regression is that the estimated coefficients can be
      too high due to overfitting. Because of that, the model parameters are added to the
      /loss function/[fn::a function that is minimized during the regression] as a penalty.
    - Some of the already discussed methods used for classification were also used for regression.
      Following methods were used for both classification and regression:
      *DecisionTree*, *RandomForest*, *AdaBoost*, *Bagging*, and *GradientBoost*.
*** Is code quality impact higher in projects that are using some particular programming language?
    The *RQ3* discusses the impact of code quality on individual
    programming languages. The findings from the *RQ3* for each
    language are compared in the *RQ5*. This comparison is a complicated
    task because each language has different characteristics, and
    a different linter was used to measure its code quality.

    The results from $\chi^2$ tests were compared to identify
    the possible difference between the languages (in terms of code
    quality). The metrics retrieved from classification models were
    also compared. Finally, the code quality effect on the time to close a PR
    was compared between the languages (using the metrics from regressors).
* Evaluation
  The following chapter is dedicated to the findings from my research.  The first
  five subchapters focus on individual programming languages --- here I am
  giving the answers to the first four research questions.  The last research
  question (*RQ5*) is answered afterward. At the end of this chapter, I am
  discussing possible threats to validity that could eventually influence the
  outcomes of my study.
