thesis.tex
\section{RQ\textsubscript{4}: Does code quality influence the time required to close a pull request?}
\label{sec:org32c1c64}
In order to find the possible link between the code quality and the time it
takes to close a PR, regression algorithms were used. At first, the
dataset was split into two parts --- training and test set.  After that, the
regression model was trained on the training set. Then, the importance of
individual quality issues was determined using the \emph{permutation importance}
mechanism. Afterward, the model was used to predict the
time based on the data from the test set. Metrics such as \emph{mean absolute error}
(MAE), \emph{mean squared error} (MSE), and \emph{coefficient of determination} (\(R^2\))
were computed using the predicted and expected values and used to evaluate the
models.

Following regressors were used\footnote{\url{https://scikit-learn.org/stable/modules/linear\_model.html}}:
\begin{description}
\item[{LinearRegression~\cite{linreg}}] Linear regression is a commonly used type of predictive model.
It is used for modeling the linear relationship between explanatory variables (code quality issues)
and a scalar response (time to close a PR). The model that minimizes the residual sum of squares
is selected.
\item[{ElasticNet~\cite{elasticnet}}] ElasticNet is an extension of linear regression. It is adding \(L_1\) (lasso regression)
and \(L_2\) (ridge regression) penalties in order to make the linear model more robust.
The problem with the classic linear regression is that the estimated coefficients can be
too high due to overfitting. Because of that, the model parameters are added to the
\emph{loss function}\footnote{a function that is minimized during the regression} as a penalty.
\item Some of the already discussed methods used for classification were also used for regression.
Following methods were used for both classification and regression:
\textbf{DecisionTree}, \textbf{RandomForest}, \textbf{AdaBoost}, \textbf{Bagging}, and \textbf{GradientBoost}.
\end{description}
\section{RQ\textsubscript{5}: Is code quality impact higher in projects that are using some particular programming language?}
\label{sec:org5086b72}
The RQ\textsubscript{3} discusses the impact of code quality on individual
programming languages. The findings from the RQ\textsubscript{3} for each
language are compared in the RQ\textsubscript{5}. This comparison is a complicated
task because each language has different characteristics, and
a different linter was used to measure its code quality.

The results from \(\chi^2\) tests were compared to identify
the possible difference between the languages (in terms of code
quality). The metrics retrieved from classification models were
also compared. Finally, the code quality effect on the time to close a PR
was compared between the languages (using the metrics from regressors).
\chapter{Evaluation}
\label{sec:org2c89279}
The following chapter is dedicated to the findings from my research.  The first
five subchapters focus on individual programming languages --- here I am
giving the answers to the first four research questions.  The last research
question (RQ\textsubscript{5}) is answered afterward. At the end of this chapter, I am
discussing possible threats to validity that could eventually influence the
outcomes of my study.
