thesis.tex
\section{Python}
\label{sec:orgd9ede29}
In order to analyze the influence of code quality on the pull request
acceptance, 20 projects from the Python ecosystem were selected.
In total, 9452 pull requests were analyzed, and 73 \% of these PRs were accepted.
Pull requests were more accepted in less popular projects, as can be seen in
the following scatterplot:
\tikzFigure{results/python/}{stars_and_acceptance}{Stars and pull request acceptance}{fig:python_stars}

On average, one pull request introduced 5.36 issues and fixed 2.44 issues;
an accepted pull request introduced 4.62 and fixed 1.99 issues, and rejected
pull request introduced 7.86 issues and fixed 4.43 on average.
5 \% trimmed mean was used to compute these values.
\tikzFigure{results/python/}{pr_quality_heat_map}{Pull requests and quality}{fig:python_quality}

In the analyzed pull requests, Pylint detected 222 different issues.

The conventions dominated the list of issues that were fixed/introduced in
the largest number of pull requests.  The convention that was
fixed/introduced in the largest number of pull requests is
\texttt{missing-function-docstring} (in 37 \% of PRs); conventions
\texttt{invalid-name}, \texttt{line-too-long} and \texttt{consider-using-f-string} were
fixed/introduced in over 20 \% of pull requests. There were 15 issues
that were fixed/introduced in more than 10 \% of PRs, and 72 issues were in
over 1 \% of PRs (out of the 222 issues which were found in the pull
requests).  There were nine issues that were present in the analyzed pull
requests but did not influence their quality (the number of these issues was not
changed by any pull request). 13 issues were introduced/fixed in only one
pull request, and 10 of them are issues classified as errors. The most common
error is \texttt{import-error} (24 \% of PRs); however, I suspect that there will be
many false positives that arise due to linting in the isolated
environment. Sixty issues were fixed in more PRs than they were introduced.
They are 24 more PRs that fixed the warning \texttt{super-init-not-called} than the
PRs that introduced it.
\tikzFigure{results/python/}{issues_types_and_prs}{Pylint issues and \% of PRs which fixed/introduced them}{fig:python_types}

The most important Pylint issue in regards to the PR acceptance is the
\texttt{syntax-error}.  XGBoost classifier gives this error the 1.2 \%
importance. However, other classifiers consider this error less important.
On average importance of the \texttt{syntax-error} is only 0.3 \%.  The syntax error
was introduced in 17 projects. On average, rejected pull request introduced
\texttt{0.027} syntax errors, and the average accepted pull request even fixed \texttt{0.001}
syntax errors.
\tikzFigure{results/python/}{issue_importance}{Ten most important Pylint issues}{fig:python_importance}

When only introduced issues were considered, the list
of the most important issues looked differently. On the other hand, there
are some issues that appeared in the top 10 in both lists: \texttt{syntax-error},
\texttt{unused-variable} and \texttt{unused-import}. The \texttt{syntax-error} is considered
the most important issue by both methods.

When only the information about fixed issues is used, the most important issue
is \texttt{f-string-without-interpolation} (in terms of acceptance). However, no classifier
gives this issue importance over one percent.

In order to visualize the difference in quality between accepted and rejected PRs, I created PCA scatter plot:
\tikzFigure{results/python/}{acceptance_pca}{PCA scatter plot}{fig:python_pca}
In the PCA scatter plot, there is no visible difference between rejected and accepted pull requests.

To understand if the presence of some issue in the PR influences its acceptance, I created contingency matrices
and performed a \(\chi^2\) test of independence:
\tikzFigure{results/python/}{acceptance_ct}{Relationship between presence of issue and PR acceptance}{fig:python_ct}

As can be seen in Figure~\ref{fig:python_ct}, the observed number of
rejected pull requests which contained some defected is higher than
expected. For \(\chi^2\) test, \(p < \num{2.2e-16}\) and therefore, the
hypothesis that presence of some issue and PR acceptance are independent is
rejected on significance level \(\alpha = 0.05\). However, the Cramer's \(\phi_c
   \approx 0.092\); therefore, the association between issue presence and acceptance is weak.
This conclusion also supports the fact that AUROC for trained classification models is only slightly over 0.5.
The average AUC for all models is \(0.534\).

When considering only PRs that solely modified some source files, \(p < \num{5.548e-10}\)
and therefore also here the presence of some code quality issue in the PR
influences the PR acceptance.
Similar to the previous test, the \(\phi_c \approx 0.087\); therefore, the
association between the presence of the same issue and PR acceptance is weak.

Almost identical results were obtained when the \(\chi^2\) test was performed separately for each issue category.

When the projects were considered individually, only for nine of them the \(p < \alpha\). In these projects,
the poor code quality had a negative impact on PR acceptance.
In the rest of the projects, the presence of some code quality issue does not seem to have an effect on
the PR acceptance.

The quality of the code does not seem to have an effect on the time it takes to close a pull request.
All of the trained regression models have a negative \(R^2\) score (when evaluated on the test set).
This means that trained models are worse at predicting the time than a constant (mean value).
Similar results were obtained when only introduced issues were considered and also when only
fixed issues were considered.
