thesis.org
** Java
   The next programming language that was analyzed is Java. In total, the 8887
   pull requests were linted, and 73 % of these pull requests were accepted.
   On average, the one pull request introduced 20 new PMD issues but,
   at the same time, also fixed 18 other issues.

   Like int the Python projects, the pull request from the less popular project
   were more likely to be accepted than pull requests from more popular projects.
   #+BEGIN_EXPORT latex
   \begin{figure}[H]\centering
   \resizebox{\textwidth + 2cm}{!}{%
     \input{results/java/stars_and_acceptance}
   }
   \caption{Stars and pull request acceptance}
   \end{figure}
   #+END_EXPORT

   Only 1366 pull requests (from the total of 8887 pull requests) did not change
   the quality of the source code (did not fix nor introduce some PMD issues).
   The PMD linter was able to detect 253 different issues in the given pull requests.
   Most of the introduced issues were issues related to the code style. In total,
   all of the pull requests introduced over a million code-style issues.
   #+BEGIN_EXPORT latex
   \begin{figure}[H]\centering
   \resizebox{\textwidth + 2cm}{!}{%
     \inputTikz{results/java/}{pr_quality_heat_map}
   }
   \caption{Pull requests and quality}
   \end{figure}
   #+END_EXPORT

   The issue that was introduced in the largest number of pull requests is
   =CommentRequired= (documentation issue).  Another frequent issues are
   =LocalVariableCouldBeFinal=, =MethodArgumentCouldBeFinal= (code style issues)
   and =LawOfDemeter= (issue in code design). These issues are the only issues
   that were introduced in more than 3000 pull requests. Similarly, the list of issues
   that were fixed in the largest number of the pull request is dominated by the
   very same issues.

   #+BEGIN_EXPORT latex
   \begin{figure}[H]\centering
   \resizebox{\textwidth + 2cm}{!}{%
     \input{results/java/issues_types_and_prs}
   }
   \caption{PMD issues and \% of PRs which fixed/introduced them}\label{fig:pmd_issues_prs}
   \end{figure}
   #+END_EXPORT
   As can be seen in Figure\nbsp{}\ref{fig:pmd_issues_prs}, the documentation issues
   tend to appear in a large number of pull requests (24 % on average). Moreover,
   the typical code style issue appeared in 11 % of pull requests. On the other
   end of the spectrum, an average issue indicating an error-prone construct is present in only two
   percent of pull requests.

   #+BEGIN_EXPORT latex
   \begin{figure}[H]\centering
   \input{results/java/issue_importance}
   \caption{Ten most important PMD issues}
   \end{figure}
   #+END_EXPORT
   The most important PMD issue is =JUnitAssertionsShouldIncludeMessage=. The
   average importance of this issue is only 0.6 %. However, the AdaBoost
   classifier gives this issue 3.7 % importance.  The 0.89 issues of this type
   are introduced in an average accepted pull request. I suspect that the pull
   requests that are adding a larger number of tests to the codebase have a higher
   probability of being accepted. At the same time, these pull requests also have a higher probability
   of introducing the =JUnitAssertionsShouldIncludeMessage=. This can be the
   reason why this issue has the largest importance.  This also supports the
   study that shows that the acceptance likelihood is increased by 17.1 % when
   tests are included[[cite:social]]. However, another performed study indicates that
   the presence of test code does not influence PR acceptance[[cite:exploratory]].

   The PCA scatter plot for Java pull requests looks as follows:
   #+BEGIN_EXPORT latex
   \begin{figure}[H]\centering
   \input{results/java/acceptance_pca}
   \caption{PCA scatter plot}
   \end{figure}
   #+END_EXPORT
   In the PCA scatter plot, there is no visible difference between rejected/accepted pull requests.

   To understand the relationship between acceptance and the introduction of a quality issue,
   the $\chi^2$ test was performed.
   #+BEGIN_EXPORT latex
   \begin{figure}[H]\centering
   \resizebox{\textwidth}{!}{%
     \input{results/java/acceptance_ct}
   }
   \caption{Relation between presence of issue and PR acceptance}
   \end{figure}
   #+END_EXPORT
   The $p = \num{9.132e-14} < \alpha$ and $\phi_c = 0.079$; therefore, there is
   a weak relation between acceptance and issue presence. Similar results were
   obtained when only PRs that solely modified the source code of the main language were
   considered and also when the test was performed individually for each issue category.

   17 out of the 20 Java projects contained a sufficient number of pull requests to
   perform the $\chi^2$ tests. In nine of them, the code quality and acceptance are
   not independent. Unexpectedly, in one of the projects (=alibaba/fastjson=) the
   presence of an issue has a small positive effect on the acceptance.

   The PMD issues seem to have some effect on the time it takes to close a pull
   request when considering only $R^2$ computed for each model. However, the
   $R^2$ value is usually not a good metric for evaluate non-linear models;
   it can reveal some information about the model, but it does not give us
   information on how accurate the model is. There are three models that have $R^2
   > 0.4$: Bagging, GradientBoost and RandomForest.  The linear regression has
   $R^2 = 0.1257$; therefore for this model, 13 % of the variance in time to close a
   PR can be explained by quality issues. However, all of the models have high mean
   absolute error (MAE). The average MAE value for all of the models is $3934338
   \approx 46\text{ days}$ and 87 % of all analyzed Java pull requests were
   closed within one month. Therefore these models are basically useless in
   practice. The other models (when considering only rejected/fixed issues) yielded
   similar results. To conclude, the found quality issues do not seem to have an
   effect on the time to close a pull request.
