thesis.tex
\section{Kotlin}
\label{sec:org01056e8}
The 20 projects were also selected from the Kotlin ecosystem.
The average analyzed pull request was from a project that has ten thousand
stars and introduced nine issues and fixed only four. The 7514 pull requests
were analyzed (using the \emph{ktlint} linter), and 80 \% of them were accepted.
The trend that maintainers of popular projects reject more pull requests can
also be observed in the Kotlin community.
\tikzFigure{results/kotlin/}{stars_and_acceptance}{Stars and pull request acceptance}{fig:kotlin_stars}

Only 20 different issues were detected by the \emph{ktlint} in the analyzed projects;
however, this is expected since the \emph{ktlint} is focused only on a small set of quality issues.

The \texttt{indent} is the issue that was introduced in the largest number of pull requests (2598). It is the
only issue that was introduced in more than a thousand pull requests. It is also the issue
that was fixed in the largest number of pull requests. The official Kotlin convention is
to use the four spaces for indentation\footnote{\url{https://kotlinlang.org/docs/coding-conventions.html}},
and the \texttt{indent} issue signifies that this convention was violated. This issue influenced
the code quality of more than half of the pull requests. However, this can be caused by projects
whose standards do not follow the official recommendations.

Other often violated \emph{ktlint} rules are \texttt{no-wildcard-imports}, \texttt{final-newline}, and \texttt{import-ordering}.
On the other end of the spectrum, the rule \texttt{no-line-break-after-else} was violated only once.

\tikzFigure{results/kotlin/}{pr_quality_heat_map}{Pull requests and quality}{fig:kotlin_quality}

\tikzFigure{results/kotlin/}{issue_importance}{Ten most important ktlint issues}{fig:kotlin_importance}
The issue with the highest importance average is \texttt{dot-spacing}.
The Bagging classifier gives 1.7 \% importance to this issue. The importance obtained from other
classifiers is smaller --- the average importance is 0.8 \%.
However, this issue was introduced only in 18 PRs (13 times in the rejected pull request).
Furthermore, seven accepted and seven rejected pull requests fixed this issue.
Therefore the impact of this issue is disputable.

It is worth mentioning that fourth most important issue does not have a name
(given by \emph{ktlint}).  This issue usually indicates an invalid Kotlin file.  This
issue has high importance (relative to the other issues) also when the only
fixed and also when only introduced issues were taken into account during the
classification. This issue was introduced by 90 rejected PRs and by 51
accepted PRs.

When using only introduced issues, the most important issue is \texttt{indent}.
This issue is also most important when only the fixed issues are considered.
As being said before, in projects that are using non-standard indentation,
this issue is a false positive.

The PCA scatter plot was also created for the Kotlin programming language.
The first principal component explains almost all variance in the code quality of pull requests.
However, the difference between rejected/accepted pull requests is not apparent from the PCA plot:
\tikzFigure{results/kotlin/}{acceptance_pca}{PCA scatter plot}{fig:kotlin_pca}

To understand the link between acceptance and the introduction of some
quality issue, I performed the \(\chi^2\) test on Kotlin dataset. The \(p < \num{2.2e-16}\) and
\(\phi_c \approx 0.095\); therefore, the presence of some issue has a small
negative effect on acceptance (similarly to the Java and Python).
Furthermore, three classifiers (\emph{Bagging}, \emph{GradientBoost}, and \emph{RandomForest})
have AUC for ROC curve above 60, and the average AUC is \(57.58\).
\tikzFigure{results/kotlin/}{acceptance_ct}{Relationship between presence of issue and PR acceptance}{fig:kotlin_ct}
However, taking into account solely the PRs that only modified some source
code, the \(p = 0.627\), thus the acceptance and issue presence are independent
(in this context).

Only 12 of the projects have a sufficient number of pull requests to evaluate
the \(\chi^2\) test. There are four projects where the presence of some issue
has a small impact on the PR acceptance (the average Cramer's V is \(\phi_c = 0.18\)).

To analyze the relation between the code quality and time that is required to
close a PR, I applied several regression techniques also to the Kotlin
dataset.  For linear regression, \(R^2 = 0.164\), therefore the trained model is
able to explain 16 \% of the variance in the time to close a PR. The \(MAE =
   2375121 \approx 27\text{ days}\); therefore, the model does not perform so well
on the dataset, taking into consideration that 89 \% of pull requests were
closed within one month. The mean absolute error for other models was similar
to the \(MAE\) obtained for linear regression.
