thesis.tex
\section{Haskell}
\label{sec:org4e80d24}
Haskell is the only purely functional programming language that was analyzed.
The 18 out of 20 selected Haskell projects have under the 5000 stars. There
are only two exceptions: PureScript with 7632 stars and Pandoc, which has over
15000 stars. The Pandoc has the also smallest percentage of accepted pull
requests.  However, excluding the Pandoc, there is no visible connection
between the number of stars and acceptance in the selected projects. When the
outliers are filtered, the trend tends to be the opposite of previous languages:
more accepted are pull requests of projects with more stars.  However, only
20 projects are not sufficient to make such conclusions about the whole
population of Haskell projects.
\tikzFigure{results/haskell/}{stars_and_acceptance}{Stars and pull request acceptance}{fig:haskell_stars}

The 6949 pull requests were analyzed. Interestingly, in over 60
\% of pull requests, no change in the code quality was detected. Moreover, the
\emph{HLint} is able to recognize a large number of different issues (321 issue
types were detected in selected pull requests). On the other hand, some issues
were counted twice because they appeared as a suggestion but also as a warning
(in the different contexts).
These facts can indicate that a large
number of submitted pull requests follow high-quality standards.
\tikzFigure{results/haskell/}{pr_quality_heat_map}{Pull requests and quality}{fig:haskell_quality}

Seventy-eight percent of pull requests were accepted, and the average pull request introduced
only 0.6 issues and fixed 0.3 issues. The most common types of issues were suggestions
and warnings. The error that was introduced in the largest number of pull requests is
\texttt{Use-newTVarIO}, and this error was introduced only in 8 pull requests. The most common
suggestions were \texttt{Redundant-bracket} (introduced in 499 PRs) and \texttt{Redundant-\$} (444 PRs).
The warning \texttt{Unused-LANGUAGE-pragma} was introduced in 323 pull requests and \texttt{Eta-reduce}
warning in 214 of them. There were only ten issues that were introduced in 100 and more
pull requests; and another 105 issue types were detected in the analyzed code, but no PR introduced
any of those issues.
\tikzFigure{results/haskell/}{issues_types_and_prs}{HLint issues and \% of PRs which fixed/introduced them}{fig:haskell_types}

The most important Haskell issue is the suggestion \texttt{Use-if}. However, no classifier gives this
issue importance over one percent. Therefore the actual impact of this issue is disputable.
This issue was introduced in 18 rejected PRs and fixed in 11. There are 19 accepted PRs that
introduced \texttt{Use-if} and 27 accepted PRs that fixed it.
\tikzFigure{results/haskell/}{issue_importance}{Ten most important HLint issues}{fig:haskell_importance}
When only introduced issues were taken into account, the most important issue is \texttt{Move-brackets-to-avoid-\$} (suggestion).
The AdaBoost classifier gives this issue 1 \% importance, although the average importance is only 0.4 \%.

In the context of fixed issues, the most important is warning \texttt{Use-fewer-imports} with average importance again only about 0.4 \%.

The PCA scatter plot was also generated for the Haskell language.
Similar to the results in already analyzed languages, there is no apparent
difference between accepted and rejected pull requests.
\tikzFigure{results/haskell/}{acceptance_pca}{PCA scatter plot}{fig:haskell_pca}

For the \(\chi^2\) test, the \(p = 0.001438 < \alpha = 0.05\) and Cramer's V is only \(\phi_c = 0.038\);
therefore, the presence of an issue in the PRs has only a small negative impact on the
acceptance of the pull request. Similar results were obtained when only
the pull requests that contain exclusively some modified code were considered.
Furthermore, tests for the individual issue types also yielded similar results.
Unfortunately, there is only a small number of pull requests that introduced some errors;
therefore the \(\chi^2\) test cannot be performed on this issue category.
The average AUC computed for ROC curves is around 50 --- the classification algorithms
were unable to distinguish between the accepted and rejected PRs using the code quality.
\tikzFigure{results/haskell/}{acceptance_ct}{Relationship between presence of issue and PR acceptance}{fig:haskell_ct}
The 13 projects contain a sufficient number of pull requests; the acceptance and
the issue presence are not independent only in four of them (there, the issue presence
have a small negative impact on the acceptance). For the \texttt{haskell/aeson} project,
the Cramer's V is \(0.282\) --- the association is ``medium''.

The issues detected by \emph{HLint} do not seem to have an impact on the time it takes to close a pull request.
All trained models have negative \(R^2\). When only fixed issues were used for regression, there
were three models with positive \(R^2\): Bagging (0.0315), ElasticNet (0.0085), and RandomForest (0.0229).
However, all of them have high mean absolute error: Bagging (\(2193658 \approx 25\text{ days}\)),
ElasticNet (2255678), and RandomForest (2201347).
