thesis.org
** C/C++
   The C and C++ programming languages are analyzed together because they share
   a lot of similarities.  This usually enables use of the same linter for both
   languages. Moreover, it is not uncommon that projects that are written in C++
   also contain some C code and vice versa.  The nine selected projects have more
   code written in C, while the rest of the 11 projects is more C++-oriented.

   In analyzed projects, there is no visible connection between the acceptance
   and the number of stars.
   #+BEGIN_EXPORT latex
   \begin{figure}[H]\centering
   \resizebox{\textwidth + 2cm}{!}{%
     \input{results/c_cpp/stars_and_acceptance}
   }
   \caption{Stars and pull request acceptance}
   \end{figure}
   #+END_EXPORT

   I analyzed 8774 C/C++ pull requests. Seventy-seven percent of them have been accepted.
   The typical pull request introduces 0.25 issues and fixes 0.12 issues; the typical
   rejected PR introduces 0.79 issues, and the typical accepted PR only 0.15 issues.
   The 79 % of pull requests did not change the quality of the source code
   (in terms of the /flawfinder/ quality rules).
   #+BEGIN_EXPORT latex
   \begin{figure}[H]\centering
   \resizebox{\textwidth + 2cm}{!}{%
     \inputTikz{results/c_cpp/}{pr_quality_heat_map}
   }
   \caption{Pull requests and quality}
   \end{figure}
   #+END_EXPORT

   The most common type of issue is the note. The least common are errors. The
   /flawfinder/ was able to identify 137 different issues in the studied
   PRs. All of the top ten issues (in terms of number of PRs which introduced
   them) are notes. The most common note is =buffer-char= ("Statically-sized
   arrays can be improperly restricted leading to potential overflows or other
   issues\dots{}"). The most common error is =buffer-strcat= ("Does not check
   for buffer overflows when concatenating to destination\dots"), and it is the
   11 most introduced issue (introduced in 69 pull requests). There are 36 issues
   that were present in the analyzed code, but they were not introduced in any
   pull request; 21 of them are errors.
   #+BEGIN_EXPORT latex
   \begin{figure}[H]\centering
   \resizebox{\textwidth + 2cm}{!}{%
     \input{results/c_cpp/issues_types_and_prs}
   }
   \caption{flawfinder issues and \% of PRs which fixed/introduced them}
   \end{figure}
   #+END_EXPORT

   Classification algorithms rank as the most important issue the
   =format-printf= ("If format strings can be influenced by an attacker, they
   can be exploited\dots"). However, this issue is only a /note/.  Therefore it
   does not have to indicate a defect (there will probably be a large number of
   false positives). AdaBoost and XGBoost algorithms give this issue importance
   of 1 %. The average importance is 0.7%.  This issue is also most important
   when only introduced issues are considered.  The second most important issue has
   average importance of only 0.26 %.

   The most important error is =buffer-StrCpyNA= ("Does not check for buffer
   overflows when copying to destination\dots") with average importance of only
   0.9 %. This error is the sixth most important issue.
   #+BEGIN_EXPORT latex
   \begin{figure}[H]\centering
   \input{results/c_cpp/issue_importance}
   \caption{Ten most important flawfinder issues}
   \end{figure}
   #+END_EXPORT
   When considering only fixed issues, the =buffer-read= is the most important issue (note);
   however, the average importance is only 0.28 %.

   The PCA analysis does not reveal any significant difference between the accepted
   and rejected pull requests (in terms of code quality).
   #+BEGIN_EXPORT latex
   \begin{figure}[H]\centering
   \input{results/c_cpp/acceptance_pca}
   \caption{PCA scatter plot}
   \end{figure}
   #+END_EXPORT

   Based on the $\chi^2$ test, the presence of an issue in the PR has a small negative impact
   on the PR acceptance ($\phi_c = 0.117$).
   However, When considering only pull requests that solely modified some source files,
   Cramer's V $\phi_c = 0.024$ and $p = 0.1 > \alpha$ --- in this settings, the issue presence
   does not influence acceptance.
   #+BEGIN_EXPORT latex
   \begin{figure}[H]\centering
   \resizebox{\textwidth}{!}{%
     \input{results/c_cpp/acceptance_ct}
   }
   \caption{Relation between presence of issue and PR acceptance}
   \end{figure}
   #+END_EXPORT
   Some small impact impact was discovered when the $\chi^2$ test was performed separately for
   each issue category (the $p < \num{2.2e-16}$ and $\phi_c \approx 0.1$ for each category).
   Furthermore, in 6 out of 11 projects which have enough data to perform and evaluate the $\chi^2$ test,
   the presence of some issue in the PR has a negative effect on the PR acceptance.
   In the =minetest/minetest= and =pybind/pybind11= projects, this effect is moderate;
   for other projects, the association is small.

   In the case of C/C++, the time to close a pull request seems not to be related
   to found issues.  All the models have negative $R^2$, except the ElasticNet
   regressor. For the ElasticNet, $MAE = 4681624$ (the mean absolute error is 54
   days) --- therefore, this model also cannot be used to predict the time to
   close a PR.  Models considering only rejected issues and also models
   considering only accepted issues have yielded similar results.
