thesis.tex
\section{C/C++}
\label{sec:org8d0cf47}
The C and C++ programming languages are analyzed together because they share
a lot of similarities.  This usually enables use of the same linter for both
languages. Moreover, it is not uncommon that projects that are written in C++
also contain some C code and vice versa.  The nine selected projects have more
code written in C, while the rest of the 11 projects is more C++-oriented.

In analyzed projects, there is no visible connection between the acceptance
and the number of stars.
\tikzFigure{results/c_cpp/}{stars_and_acceptance}{Stars and pull request acceptance}{fig:c_cpp_stars}

I analyzed 8774 C/C++ pull requests. Seventy-seven percent of them have been accepted.
The typical pull request introduces 0.25 issues and fixes 0.12 issues; the typical
rejected PR introduces 0.79 issues, and the typical accepted PR only 0.15 issues.
The 79 \% of pull requests did not change the quality of the source code
(in terms of the \emph{flawfinder} quality rules).
\tikzFigure{results/c_cpp/}{pr_quality_heat_map}{Pull requests and quality}{fig:c_cpp_quality}

The most common type of issue is the note. The least common are errors. The
\emph{flawfinder} was able to identify 137 different issues in the studied
PRs. All of the top ten issues (in terms of number of PRs which introduced
them) are notes. The most common note is \texttt{buffer-char} (``Statically-sized
arrays can be improperly restricted leading to potential overflows or other
issues\dots{}''). The most common error is \texttt{buffer-strcat} (``Does not check
for buffer overflows when concatenating to destination\dots{}''), and it is the
11 most introduced issue (introduced in 69 pull requests). There are 36 issues
that were present in the analyzed code, but they were not introduced in any
pull request; 21 of them are errors.
\tikzFigure{results/c_cpp/}{issues_types_and_prs}{flawfinder issues and \% of PRs which fixed/introduced them}{fig:c_cpp_types}

Classification algorithms rank as the most important issue the
\texttt{format-printf} (``If format strings can be influenced by an attacker, they
can be exploited\dots{}''). However, this issue is only a \emph{note}.  Therefore it
does not have to indicate a defect (there will probably be a large number of
false positives). AdaBoost and XGBoost algorithms give this issue importance
of 1 \%. The average importance is 0.7\%.  This issue is also most important
when only introduced issues are considered.  The second most important issue has
average importance of only 0.26 \%.

The most important error is \texttt{buffer-StrCpyNA} (``Does not check for buffer
overflows when copying to destination\dots{}'') with average importance of only
0.9 \%. This error is the sixth most important issue.
\tikzFigure{results/c_cpp/}{issue_importance}{Ten most important flawfinder issues}{fig:c_cpp_importance}
When considering only fixed issues, the \texttt{buffer-read} is the most important issue (note);
however, the average importance is only 0.28 \%.

The PCA analysis does not reveal any significant difference between the accepted
and rejected pull requests (in terms of code quality).
\tikzFigure{results/c_cpp/}{acceptance_pca}{PCA scatter plot}{fig:c_cpp_pca}

Based on the \(\chi^2\) test, the presence of an issue in the PR has a small negative impact
on the PR acceptance (\(\phi_c = 0.117\)).
However, When considering only pull requests that solely modified some source files,
Cramer's V \(\phi_c = 0.024\) and \(p = 0.1 > \alpha\) --- in this settings, the issue presence
does not influence acceptance.
\tikzFigure{results/c_cpp/}{acceptance_ct}{Relationship between presence of issue and PR acceptance}{fig:c_cpp_ct}
Some small impact impact was discovered when the \(\chi^2\) test was performed separately for
each issue category (the \(p < \num{2.2e-16}\) and \(\phi_c \approx 0.1\) for each category).
Furthermore, in 6 out of 11 projects which have enough data to perform and evaluate the \(\chi^2\) test,
the presence of some issue in the PR has a negative effect on the PR acceptance.
In the \texttt{minetest/minetest} and \texttt{pybind/pybind11} projects, this effect is moderate;
for other projects, the association is small.

In the case of C/C++, the time to close a pull request seems not to be related
to found issues.  All the models have negative \(R^2\), except the ElasticNet
regressor. For the ElasticNet, \(MAE = 4681624\) (the mean absolute error is 54
days) --- therefore, this model also cannot be used to predict the time to
close a PR.  Models considering only rejected issues and also models
considering only accepted issues have yielded similar results.
