thesis.org
** Programming languages and code quality impact
   Comparing the code quality of projects written in different programming
   languages is a difficult task.  Each language has different programming
   constructs, syntax, and type system. For instance, Python, which is
   a dynamically-typed multi-paradigm programming language, has completely
   distinct characteristics from Haskell, which is a purely functional programming
   language with a strong, static type system.

   Moreover, every linter is different and has a unique set of rules.  The
   /ktlint/ is focused on code clarity and community conventions, whereas
   /flawfinder/ checks code for potentially dangerous functions. On the other
   hand, the /PMD/ is a more general-oriented linter that contains a large set of
   rules for the Java programming language. Lastly, the /HLint/ is oriented mainly
   on code simplification and spotting redundancies.

   On the other hand, there are some metrics that evaluate how effectively
   trained models predict the acceptance of PR or time to close a PR;
   and these metrics can be compared across different programming languages.
   On top of that, the results from the $\chi^2$ test can also be compared.
   However, the cation is in order because the code quality for each language is
   evaluated differently, as discussed before.
   #+BEGIN_EXPORT latex
   \begin{figure}[H]\centering
   \resizebox{\textwidth}{!}{%
     \input{results/all_cramers_v}
   }
   \caption{Comparison of Cramer's V}\label{fig:all_v}
   \end{figure}
   #+END_EXPORT
   As can be seen in Figure\nbsp{}\ref{fig:all_v}, in all studied languages, the
   presence of some issue have a negative effect on the PR acceptance (in terms
   of $\chi^2$ tests); however, for all of the languages, this effect is small ($\phi_c
   \approx 0.1$).  The smallest effect was observed for Haskell programming
   language and the highest effect for C/C++.  On the other hand,
   taking into account solely the PRs that only modified some source code of the
   primary language, the $\chi^2$ test indicates that the presence of issue and PR
   acceptance are independent in the case of the C/C++ and Kotlin. This is a possible
   threat to validity.

   The effect of code quality on acceptance was also studied using
   classification algorithms.  One of the metrics that were used to measure the
   performance of the classification models is the "area under the ROC curve"
   (AUC). When using this metric to evaluate models, the Haskell is once again
   the language when the code quality is least important
   (Figure\nbsp{}\ref{fig:all_auc}). The average AUC for Haskell models is around
   0.5 --- the trained models are no better than random guessing.
   The models for the Kotlin are ranked with the highest AUC score and therefore
   are better in classification than models for other languages.
   Except for Haskell, the average AUC is over 0.5 but under 0.6 --- these AUC
   scores are usually considered poor[[cite:logreg]]. This indicates that code quality
   has only a small or no effect on the acceptance.

   As can be seen, similar results were obtained for all of the languages.
   In all of the languages, the code quality impact is small (based on the $\chi^2$ tests
   and also based on the results from classification algorithms). There is no language
   that significantly differs from others.
   #+BEGIN_EXPORT latex
   \begin{figure}[H]\centering
   \resizebox{\textwidth}{!}{%
     \input{results/all_auc}
   }
   \caption{AUC for differenct languages (ROC)}
   \end{figure}\label{fig:all_auc}
   #+END_EXPORT

   As discussed in the previous chapter, there seems to be no connection between
   the code quality and the time it takes to close pull requests (based on the
   trained regression models).  The smallest MAE was scored by Kotlin models
   (around 26 days); on the other end of the spectrum are Python models with an
   average MAE equal to 78.9 days. The trained models are unusable, considering
   that most of the pull requests are closed within the first two weeks (83 % of Kotlin
   PRs and 76% of Python PRs).
   #+BEGIN_EXPORT latex
   \begin{figure}[H]\centering
   \resizebox{\textwidth}{!}{%
     \input{results/all_mae}
   }
   \caption{Mean absolute error for prediction of time to close a PR}
   \end{figure}
   #+END_EXPORT
** Threats to validity
   The validity of my research is endangered by several things.
   At first, the selection of the projects is one of the factors that influence
   the outcomes of the research. This study is focused primarily on popular
   projects. The rationale behind the project selection is explained in the own dedicated
   subchapter. It is possible that projects selected using different metrics can yield
   varying results.

   Another possible threat to validity is the selection of pull requests.
   It is usually not doable to examine all the pull requests of some project.
   For the projects with a huge number of PRs, the time and computational resources are
   the limiting factors. Moreover, to examine the rejected pull requests, the forked
   repository with the required commits needs to be available. This is not always the case.
   Sometimes the /force push/ can also remove the commits from the accepted pull requests.
   It is also important to note that linting of some pull requests resulted in an error in the
   linter, and therefore these PRs were skipped. Pull requests were also skipped if the
   linting time exceeded the limit (that was set to 1000 seconds) --- the PRs that
   modified a huge number of files were ignored. Furthermore, for some projects,
   the number of analyzed pull requests was limited to 500 to reduce the total
   time required for analysis.

   Another problem is that pull requests can be merged manually outside GitHub.
   These pull requests are not recognized as accepted[[cite:ghperils]]. The projects were selected so that
   GitHub is the primary way to merge PRs. However, there still can be some PRs
   merged using alternative methods.

   Furthermore, different methods can be used to measure the quality of pull
   requests. For each programming language, there exist several linters that
   are focused on a different set of issues, and they can also use different algorithms
   to detect the same issue. Another possible threat are false positives from linters.
   The false-positive can arise due to the fact that the files were linted in the
   isolated environment, and this can introduce some issues (=import-error=, etc.).
   Some issues are also hard to detect; for instance, the issue can be specific to
   some particular context, and the linter does not have to take this context into
   account. The greatest difficulty with the quality evaluation is the fact that
   everyone has a unique personal perspective on code quality --- code quality
   does not have a single definition.

   The pull requests sometimes contain also files that are not written in the
   primary programming language of the project. The pull request then can be
   rejected because of these files.

   Lastly, there are several factors that influence PR acceptance.
   Some of them were discussed in previous chapters (number of commits, submitter's status, etc.).
   The one factor that influences the acceptance is a number of lines that were changed[[cite:social]].
   The more lines are added/changed, the higher the probability that the pull request will be
   rejected, but the chance that some quality issue will be introduced is also higher.
   In this case, it is difficult to distinguish if the pull request was rejected because
   of the code quality or because the changes are too big.
