thesis.tex
\chapter{Conclusion}
\label{sec:orge3d917e}
I analyzed 41576 pull requests from 100 projects written in 5 different
programming languages (Python, Java, Kotlin, Haskell, C/C++) to study the
relationship between the code quality and pull request acceptance.  The
quality of the individual pull requests was measured using static code
analysis.

Almost half of the analyzed PRs introduced some code quality issue, and 31 \%
of pull requests fixed some issue. However, data differs significantly between
the languages (because different static analysis tools were used).  In C/C++
projects, only 16 \% of pull requests introduced some issue, while in Java,
almost 76 \% of PRs. The proportion of accepted pull requests was different for
each project; however, on average, 76 \% of PRs were accepted.

Several statistic techniques were used to understand if the code quality
affects PR acceptance. For each language, the \(\chi^2\) test of independence
was performed, and the number of accepted PRs without a code quality issue was always
higher than expected. However, in all languages, the impact on acceptance was
only small (\(\phi_c \approx 0.1\)).

Multiple classification algorithms were used to predict the pull request acceptance
using the code quality. However, all of them performed poorly (\(AUROC < 0.6\)).
The most problematic was the Haskell language --- all models were no better than a random
predictor (\(AUROC \approx 0.5\)).

The trained models were also used to understand the importance of individual issues.
Unfortunately, no issue with a significant impact on the PR acceptance was detected.
All discovered issues have average importance below 1 \% (between all models).

The influence of code quality on time to close a PR was also
studied. Several regression models were trained to predict this time. However,
all of the trained models have very high \emph{mean absolute error}: around one month.
This makes models worthless because most of the PRs are closed within two
weeks.

To conclude, the poor code quality seems to have a small negative impact on the
pull request acceptance. However, there seems to be no effect on the time it
takes to close a PR.
\section{Comparison with related work}
\label{sec:org0ba47a0}
Best of my knowledge, there is only one study~\cite{quality} about the effect of quality flaws
on the pull request acceptance. Lenarduzzi et al. analyzed 28 well-known Java projects.
I reused the script they provided for PR classification and also applied similar statistical
techniques so that my findings could be compared with theirs.
The \(\chi^2\) test of independence yielded similar results (they obtained \(\phi_c = 0.12\)).
My classification models have slightly better performance (mean \(AUROC\) is higher by \(0.023\)).
The difference in performance can be caused by various factors --- project
selection and the ratio of accepted pull requests (only 53 \% of PRs they studied were accepted).
The code quality was evaluated using the same linter (PMD). However, I also took into
account issues that were fixed by the PR. Moreover, a different technique was used to identify
issues that were introduced in the PR (they used diff-files provided by GitHub API).
Similar to my findings, Lenarduzzi et al. did not identify any particular issues that have a significant
effect on the acceptance.

I extended the work of Lenarduzzi with an analysis of four new programming
languages (Python, Kotlin, Haskell, and C/C++).  I also added the analysis
of the delivery time of pull requests, and as far as I know, this is the first
study that researches the relationship between the code quality and the time it
takes to close a pull request.
\section{Future work}
\label{sec:org0f9e898}
I consider my work complete. However, there is still plenty of
possibilities for how to improve and expand my work.
Several improvements can be made to obtain more reliable data for analysis.
If the pull request is not merged using GitHub, then the PR is incorrectly classified as rejected.
It is possible to utilize some heuristics that will recognize merging through plain Git utilities.

For the proper quality evaluation, the linter choice is essential. Each
linter is focused on some specific set of issues, and this can introduce
some form of bias. It would be beneficial to use multiple linters for one
programming language. The linters used for C/C++ and Kotlin are not very
sophisticated.  However, adding a more advanced linter for C/C++ is
complicated --- the state-of-the-art linters require information about
compiler flags. This information cannot always be retrieved automatically
(from makefiles).  Therefore, a lot of pull requests require manual
customization.

Some projects use linters as part of the \emph{continuous integration} or
during the build process. Additional research needs to be performed to
understand if the maintainers of those projects are more strict about the
code quality, and therefore the effect on the PR acceptance is larger.
\chapter*{Appendix}
\label{sec:org0fa219a}
\addcontentsline{toc}{chapter}{Appendix}
\section*{Scripts used for analysis}
\label{sec:orgf9558d8}
\begin{itemize}
\item \textbf{TODO:} fix grammar
\end{itemize}
In order to simplify analysis of retrieved data, I created the script (\texttt{pr\_process.py}) that
takes multiple JSON files with the data about each individual project and
converts them into the CSV files. Each row in the CSV file represents some
pull request. This script also filters the pull requests which are not
suitable for the analysis --- PRs that do not contains any source code written
in the primary language or PRs that contained corrupted files (the linter was
unable to analyze those files).

The retrieved data about the pull request were subsequently analyzed in order
to answer my research questions. For the classification (RQ\textsubscript{2}) was used the Python
script\footnote{\url{https://figshare.com/s/d47b6f238b5c92430dd7}} (\texttt{pr\_classification.py}) provided by Lenurdazzi
et al.~\cite{quality}.

I also created the script (\texttt{pr\_reqression.py}) that runs the regression algorithms on the data in order to answer RQ\textsubscript{4}.
This script is written in Python and it uses scikit-learn\footnote{\url{https://scikit-learn.org/stable/index.html}} library.

The rest of the analysis was done using the \texttt{analysis.R}. This small R program imports the data
generated by other scripts. This data are then analyzed using various statistical methods.
Script is also used to plot graphs, create tables and then export them directly into the \LaTeX{}.
\section*{Projects}
\label{sec:org62ed643}
\begin{table}[H]
\caption{Python projects}
\centering
\begingroup\scriptsize
\input{results/python/projects_summary}
\endgroup
\end{table}

\begin{table}[H]
\caption{Java projects}
\centering
\begingroup\scriptsize
\input{results/java/projects_summary}
\endgroup
\end{table}

\begin{table}[H]
\caption{Kotlin projects}
\centering
\begingroup\scriptsize
\input{results/kotlin/projects_summary}
\endgroup
\end{table}

\begin{table}[H]
\caption{Haskell projects}
\centering
\begingroup\scriptsize
\input{results/haskell/projects_summary}
\endgroup
\end{table}

\begin{table}[H]
\caption{C/C++ projects}
\centering
\begingroup\scriptsize
\input{results/c_cpp/projects_summary}
\endgroup
\end{table}

\FloatBarrier
